In [82]:
%load_ext sql
%config SqlMagic.autocommit=True

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [83]:
%sql mssql+pyodbc://sa:Lily870104@MSSQLTest

In [84]:
# 没有办法create database
%sql create database test2; commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.ProgrammingError) ('42000', '[42000] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]CREATE DATABASE statement not allowed within multi-statement transaction. (226) (SQLExecDirectW)')
[SQL: create database test2;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [85]:
%sql use test1

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[]

In [86]:
%%sql create table emp (
    emp_id int,
    l_name varchar(50) not null,
    f_name varchar(50) not null,
    constraint emp_pk1 primary key(emp_id)
);

commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.ProgrammingError) ('42S01', "[42S01] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]There is already an object named 'emp' in the database. (2714) (SQLExecDirectW)")
[SQL: create table emp (
    emp_id int,
    l_name varchar(50) not null,
    f_name varchar(50) not null,
    constraint emp_pk1 primary key(emp_id)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [76]:
%sql select * from emp;

 * mssql+pyodbc://sa:***@MSSQLTest
0 rows affected.

[]

In [72]:
%%sql drop table emp1;
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
(pyodbc.ProgrammingError) ('42S02', "[42S02] [Microsoft][ODBC Driver 18 for SQL Server][SQL Server]Cannot drop the table 'emp1', because it does not exist or you do not have permission. (3701) (SQLExecDirectW)")
[SQL: drop table emp1;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [90]:
## 不想某列为空的话，需要指定 not null
%sql create table test_table( \
    emp_id int, \
    last_name varchar(50) not null, \
    first_name varchar(50) not null); commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [92]:
##  修改表
%%sql alter table test_table add age int; 
    commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [96]:
## 删除列
%sql alter table test_table drop column age; commit;

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]

In [97]:
# 修改字段类型
%%sql alter table test_table alter column emp_id varchar(10)
    commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.

[]

In [105]:
# 删除表，删完就回不来了
%sql drop table test_table;commit

 * mssql+pyodbc://sa:***@MSSQLTest
Done.
Done.

[]